ahung1407/STM32LAB/timer/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ROW_7_Pin GPIO_PIN_2
#define ROW_7_GPIO_Port GPIOA
#define DOT_Pin GPIO_PIN_4
#define DOT_GPIO_Port GPIOA
#define LED_RED_Pin GPIO_PIN_5
#define LED_RED_GPIO_Port GPIOA
#define En1_Pin GPIO_PIN_6
#define En1_GPIO_Port GPIOA
#define En2_Pin GPIO_PIN_7
#define En2_GPIO_Port GPIOA
#define EMN_6_Pin GPIO_PIN_0
#define EMN_6_GPIO_Port GPIOB
#define EMN_7_Pin GPIO_PIN_1
#define EMN_7_GPIO_Port GPIOB
#define ROW_0_Pin GPIO_PIN_2
#define ROW_0_GPIO_Port GPIOB
#define LED_E_Pin GPIO_PIN_10
#define LED_E_GPIO_Port GPIOB
#define LED_F_Pin GPIO_PIN_11
#define LED_F_GPIO_Port GPIOB
#define LED_G_Pin GPIO_PIN_12
#define LED_G_GPIO_Port GPIOB
#define ROW_4_Pin GPIO_PIN_13
#define ROW_4_GPIO_Port GPIOB
#define ROW_5_Pin GPIO_PIN_14
#define ROW_5_GPIO_Port GPIOB
#define ROW_6_Pin GPIO_PIN_15
#define ROW_6_GPIO_Port GPIOB
#define En3_Pin GPIO_PIN_8
#define En3_GPIO_Port GPIOA
#define En4_Pin GPIO_PIN_9
#define En4_GPIO_Port GPIOA
#define EMN_0_Pin GPIO_PIN_10
#define EMN_0_GPIO_Port GPIOA
#define EMN_1_Pin GPIO_PIN_11
#define EMN_1_GPIO_Port GPIOA
#define EMN_2_Pin GPIO_PIN_12
#define EMN_2_GPIO_Port GPIOA
#define EMN_3_Pin GPIO_PIN_13
#define EMN_3_GPIO_Port GPIOA
#define EMN_4_Pin GPIO_PIN_14
#define EMN_4_GPIO_Port GPIOA
#define EMN_5_Pin GPIO_PIN_15
#define EMN_5_GPIO_Port GPIOA
#define ROW_1_Pin GPIO_PIN_3
#define ROW_1_GPIO_Port GPIOB
#define ROW_2_Pin GPIO_PIN_4
#define ROW_2_GPIO_Port GPIOB
#define ROW_3_Pin GPIO_PIN_5
#define ROW_3_GPIO_Port GPIOB
#define LED_A_Pin GPIO_PIN_6
#define LED_A_GPIO_Port GPIOB
#define LED_B_Pin GPIO_PIN_7
#define LED_B_GPIO_Port GPIOB
#define LED_C_Pin GPIO_PIN_8
#define LED_C_GPIO_Port GPIOB
#define LED_D_Pin GPIO_PIN_9
#define LED_D_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
